app/controllers/api/v1/favorites_controller.rb

  def create
    location = Location.find_or_create_by(
      slug: params[:slug],
      long: params[:long],
      lat: params[:lat]
      )

    if session_user

    favorite = Favorite.create(user: session_user, location_id: location.id)
---
INSERT INTO "locations" ("slug", "long", "lat") VALUES ($1, $2, $3) RETURNING "id"  [["slug", "northcarolina"], ["long", 40.12], ["lat", 42.5]]
SELECT "locations".* FROM "locations" WHERE "locations"."slug" = $1 AND "locations"."long" = $2 AND "locations"."lat" = $3 LIMIT $4  [["slug", "northcarolina"], ["long", 40.12], ["lat", 42.5], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "location_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["location_id", 386], ["created_at", "2020-06-08 07:19:42.193787"], ["updated_at", "2020-06-08 07:19:42.193787"]]

  def destroy
    favorite = Favorite.all.find(params[:id])
    favorite.destroy
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 17]]