app/controllers/api/v1/users_controller.rb

  def create
    # let's make a user using the email and password from the params
    user = User.new(
      email: params[:email],
      password: params[:password],
    )

    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"