app/controllers/application_controller.rb

  def session_user
    User.find_by(id: decoded_token)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]